In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [63]:
titanic = pd.read_csv("C:\\Users\\Satish\\Downloads\\DataSets\\titanic.csv")
titanic.head()

,PassengerId,Name,Pclass,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [64]:
titanic.columns

Index(['PassengerId', 'Name', 'Pclass', 'Gender', 'Age', 'SibSp', 'Parch',
       'Ticket', 'Fare', 'Cabin', 'Embarked', 'Survived'],
      dtype='object')

In [65]:
titanic.drop(['PassengerId', 'Name', 'SibSp', 'Parch',
       'Ticket', 'Fare', 'Cabin', 'Embarked'], axis = 1,inplace = True)

In [66]:
titanic.head()

   Pclass  Gender   Age  Survived
0       3    male  22.0         0
1       1  female  38.0         1
2       3  female  26.0         1
3       1  female  35.0         1
4       3    male  35.0         0

In [67]:
gen_df = pd.get_dummies(titanic["Gender"],drop_first = True)
gen_df

     male
0       1
1       0
2       0
3       0
4       1
..    ...
886     1
887     0
888     0
889     1
890     1

[891 rows x 1 columns]

In [68]:
titanic = pd.concat([gen_df,titanic],axis = 1)
titanic.head()

   male  Pclass  Gender   Age  Survived
0     1       3    male  22.0         0
1     0       1  female  38.0         1
2     0       3  female  26.0         1
3     0       1  female  35.0         1
4     1       3    male  35.0         0

In [69]:
titanic.drop(['Gender'],axis = 1,inplace = True)
titanic.head()

   male  Pclass   Age  Survived
0     1       3  22.0         0
1     0       1  38.0         1
2     0       3  26.0         1
3     0       1  35.0         1
4     1       3  35.0         0

In [70]:
titanic.isnull().sum()

male          0
Pclass        0
Age         177
Survived      0
dtype: int64

In [71]:
titanic["Age"].mean()

29.69911764705882

In [72]:
titanic["Age"]=titanic["Age"].fillna(titanic["Age"].mean())
titanic.head()

   male  Pclass   Age  Survived
0     1       3  22.0         0
1     0       1  38.0         1
2     0       3  26.0         1
3     0       1  35.0         1
4     1       3  35.0         0

In [73]:
titanic.isnull().sum()

male        0
Pclass      0
Age         0
Survived    0
dtype: int64

In [75]:
titanic.head()

   male  Pclass   Age  Survived
0     1       3  22.0         0
1     0       1  38.0         1
2     0       3  26.0         1
3     0       1  35.0         1
4     1       3  35.0         0

In [77]:
x = titanic.drop("Survived",axis = 1 )
x.head()

   male  Pclass   Age
0     1       3  22.0
1     0       1  38.0
2     0       3  26.0
3     0       1  35.0
4     1       3  35.0

In [80]:
y = titanic[["Survived"]]
y.head()

   Survived
0         0
1         1
2         1
3         1
4         0

In [88]:
import warnings
warnings.filterwarnings("ignore")

In [89]:
from sklearn.model_selection import train_test_split

In [90]:
x_train,x_test,y_train,y_test = train_test_split(x,y,test_size = 0.20)

In [91]:
from sklearn.naive_bayes import GaussianNB

In [92]:
GNB_model = GaussianNB()

In [93]:
GNB_model

GaussianNB()

In [94]:
GNB_model.fit(x_train,y_train)

GaussianNB()

In [95]:
GNB_model.predict(x_test)

array([1, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 1, 1, 0, 1, 0,
       0, 1, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 0, 0, 1, 0, 0, 1, 0, 1, 1, 0,
       0, 1, 0, 0, 1, 1, 0, 1, 0, 1, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0, 0, 1,
       0, 0, 1, 0, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 1, 1, 0, 1, 1,
       0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1, 0, 0, 0, 0, 1, 1, 1, 1,
       0, 0, 1, 0, 1, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 0, 1, 0, 0, 0, 1, 1,
       0, 0, 0, 1, 1, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0,
       0, 1, 0], dtype=int64)

In [96]:
GNB_model.score(x_test,y_test)

0.776536312849162